app/helpers/subjects_helper.rb

SELECT `subjects`.* FROM `subjects`
---
  def subject_collection
    Subject.all.collect {|u| [u.name, u.id]}