app/controllers/results_controller.rb

  def index
    exam_user_tested = Result.where(user_id: current_user.id).pluck(:exam_id).uniq
---
SELECT `results`.`exam_id` FROM `results` WHERE `results`.`user_id` = 1