app/controllers/sessions_controller.rb

  def create
    user = User.find_by email: params[:session][:email].downcase
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'n.phuong2508@gmail.com' LIMIT 1