app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Phuong', 'n.phuong2508@gmail.com', '$2a$10$doiVVJIKXhVZYRm6F7KhxeJPpiePbRy9sz23amXecJGxnkfzV/ERe', '2022-03-03 09:08:47', '2022-03-03 09:08:47')

  def find_user
    @user = User.find params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1